Repository: xaiki/base-passwd
Catalog: man/po4a/po/*.po
Languages: fr

source: Debian tools
fr: Utilitaires Debian

source: NAME
fr: NOM

source: update-passwd - safely update /etc/passwd, /etc/shadow and /etc/group
fr: update-passwd - met ? jour /etc/passwd, /etc/shadow et /etc/group de fa?on s?curis?e

source: B<update-passwd> handles updates of /etc/passwd, /etc/shadow and /etc/group on running Debian systems. It compares the current files to master copies, distributed in the base-passwd package, and updates all entries in the global system range (that is, 0\(en99).
fr: B<update-passwd> g?re les mises ? jour de /etc/passwd, /etc/shadow et /etc/group sur les syst?mes Debian. Il compare les fichiers actuels avec les originaux distribu?s avec le paquet base-passwd, et met ? jour toutes les entr?es allou?es globalement par le projet Debian (c'est-?-dire de 0 ? 99).

source: B<update-passwd> follows the usual GNU command line syntax, with long options starting with two dashes (\(oq-\(cq).
fr: B<update-passwd> suit la syntaxe usuelle des commandes GNU, avec les options longues commen?ant par deux tirets (?\ -\ ?).

source: B<-p>,\ B<--passwd-master=FILE>
fr: B<-p>,?B<--passwd-master=FICHIER>

source: Use FILE as the master copy of the passwd database. The default value is I</usr/share/base-passwd/passwd.master>.
fr: Utilise FICHIER comme original de la base de donn?es ?\ passwd\ ?. La valeur par d?faut est I</usr/share/base-passwd/passwd.master>.

source: B<-g>,\ B<--group-master=FILE>
fr: B<-g>,?B<--group-master=FICHIER>

source: Use FILE as the master copy of the group database. The default value is I</usr/share/base-passwd/group.master>.
fr: Utilise FICHIER comme original de la base de donn?es ?\ group\ ?. La valeur par d?faut est I</usr/share/base-passwd/group.master>.

source: B<-P>,\ B<--passwd=FILE>
fr: B<-P>,?B<--passwd=FICHIER>

source: Use FILE as the system passwd database. The default value is I</etc/passwd>.
fr: Utilise FICHIER comme base de donn?es ?\ passwd\ ? du syst?me. La valeur par d?faut est I</etc/passwd>.

source: B<-S>,\ B<--shadow=FILE>
fr: B<-S>,?B<--shadow=FICHIER>

source: Use FILE as the system shadow database. The default value is I</etc/shadow>.
fr: Utilise FICHIER comme base de donn?es ?\ shadow\ ? du syst?me. La valeur par d?faut est I</etc/shadow>.

source: B<-G>,\ B<--group=FILE>
fr: B<-G>,?B<--group=FICHIER>

source: Use FILE as the system group database. The default value is I</etc/group>.
fr: Utilise FICHIER comme base de donn?es ?\ group\ ? du syst?me. La valeur par d?faut est I</etc/group>.

source: Only perform sanity-checks but don't do anything.
fr: Ne r?alise que les tests de contr?le, mais ne touche ? rien.

source: Give detailed information about we are doing. A second -v gives additional detail.
fr: Donne des informations pr?cises sur ce qui est r?alis?. Un second B<-v> donne encore plus de pr?cisions.

source: Don't do anything but only show what we would do.
fr: Ne fait rien, montre seulement ce qui va ?tre fait.

source: Don't attempt to lock the account database. This should only be used for debugging purposes. B<I repeat: do not do this unless you are really sure you need this!>
fr: Ne cherche pas ? verrouiller la base de donn?es des comptes. Cette option ne devrait ?tre utilis?e qu'? des fins de d?bogage. B<J'insiste\ : n'utilisez pas cette option ? moins d'?tre vraiment s?r d'en avoir besoin\ !>

source: Show a summary of how to use B<update-passwd>.
fr: Affiche un r?sum? d'aide pour l'utilisation de B<update-passwd>.

source: Show the version number
fr: Affiche le num?ro de version.

source: BUGS
fr: BOGUES

source: At this moment B<update-passwd> does not verify the shadow-file. It should check if the entries in the passwd are also in shadow and vice versa, and that passwords are not present in both files.
fr: Pour l'instant B<update-passwd> ne v?rifie pas le fichier shadow. Il devrait v?rifier si les entr?es de passwd sont ?galement dans le fichier shadow et vice versa, et que les mots de passe ne sont pas pr?sents dans les deux fichiers.

source: AUTHOR
fr: AUTEUR

source: This program was written for the Debian project, and is copyright 1999\(en2002 Wichert Akkerman and copyright 2002, 2003 Colin Watson. It is distributed under version 2 of the GNU General Public License.
fr: Ce programme a ?t? ?crit pour le projet Debian, et est plac? sous le copyright 1999\(en2002 Wichert Akkerman et le copyright 2002, 2003 Colin Watson. Il est distribu? sous la licence publique g?n?rale du projet GNU (?\ GPL\ ?) version 2.
